snippets/rss-better.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Rss: the Internet</title>
<meta name="generator" content="Org mode">
</head>
<body>
<nav id="preamble" class="status">
<link rel="stylesheet" type="text/css" href="/stylesheet.css"/>

<p align="right">
<a class="active" href="/">Home</a> |
<a href="/sitemap.html" align="right">Posts</a> |
<a href="/about.html">About</a> |
<a href="/repository.html">Repository</a>

</p>
</nav>
<main id="content">
<header>
<h1 class="title">Rss: the Internet</h1>
</header>
<div id="outline-container-org2e20647" class="outline-2">
<h2 id="org2e20647">RSS: The better Internet&#xa0;&#xa0;&#xa0;<span class="tag"><span class="snippets">snippets</span>&#xa0;<span class="news">news</span>&#xa0;<span class="internet">internet</span>&#xa0;<span class="read">read</span>&#xa0;<span class="rss">rss</span></span></h2>
<div class="outline-text-2" id="text-org2e20647">
</div>
<div id="outline-container-org3ccd3f7" class="outline-3">
<h3 id="org3ccd3f7">Cheesy Internet</h3>
<div class="outline-text-3" id="text-org3ccd3f7">
<p>
I don't have to say this, the Internet is hella bloated.. Junks are everywhere, nobody knows that they read shit, they are watching shits whole time.
</p>

<p>
Just do a test, How many popups have you closed today, How many cookies (web) have you eaten, How many captchas did you solve, How many minutes did you wait to skip an ad just to watch a video&#x2026; Even worse, ads sponsors are embedded within a video (So cruel and harsh world)
<i>It goes on</i>.
</p>

<p>
Internet and digital software's are getting so much bloated, people (normies) have forgotten Unix or say 'minimalism'. People are upgrading RAM like anything, 8GB ain't enough it-seems for them. Here, I do everything with just 4GB RAM.
People these days all need ready-made/ready-to-work  stuffs, I wonder how do they even watch DIY channels on YouTube.
</p>
</div>
</div>

<div id="outline-container-org03fd99d" class="outline-3">
<h3 id="org03fd99d">The Hero</h3>
<div class="outline-text-3" id="text-org03fd99d">
<p>
Rss stands for <b>Really Simple Syndication</b>, It is a classic on consuming web as supposedly it was built for. Today its all crappy <b>JavaScript</b> (a big bloat of cheese).
</p>

<p>
People literally have forgotten to read and embrace the text, everyone wants; YouTube tutorials, or some designed way to make them understand.
Shit, its a no joke, that's why AI have evolved these days.
Make our life easy?  Lol
</p>

<p>
It can easily fetch content from web and easily showcase the actual content only. If that content is valuable, we should value our way to taking it.
</p>

<p>
Actually many of you might know famous news reader called <b>Feedly</b>, it is based on Rss system under-the-hood.
</p>
</div>

<div id="outline-container-org3c50ae4" class="outline-4">
<h4 id="org3c50ae4">Feed Readers</h4>
<div class="outline-text-4" id="text-org3c50ae4">
<p>
If you use window there are famous readers like fluent reader.
On Linux you get <a href="https://newsboat.org/">newsboat</a> (terminal lovers), I use <a href="https://github.com/skeeto/elfeed">elfeed</a> (Emacs way).
</p>

<p>
For GUI Linux user you get : (Install with your system's package manager or use AppImage/Flathub)
</p>

<ul class="org-ul">
<li><a href="https://github.com/lwindolf/liferea/">Liferea</a></li>
<li><a href="https://github.com/yang991178/fluent-reader">Fluent-reader</a></li>
<li><a href="https://www.thunderbird.net/en-US">Thunderbird</a> (Email client + Rss)</li>
<li><a href="https://gitlab.com/news-flash/news_flash_gtk">NewsFlash</a></li>
<li><a href="https://apps.kde.org/en/akregator">Kde's Akregator</a></li>
</ul>

<p>
Watching YouTube contents is whole lot better in Mpv with sponsorblock (It gives seamless content joy)
</p>


<p>
Actually elfeed integrates so well with Emacs, I don't have to learn new stuffs for another application or keyboard shortcuts.
</p>

<p>
That's one of the reason I call <b>Emacs as the GOAT-E (Editor)</b>.
</p>

<p>
I will try to expand more bits on rss feeds value by making a detailed post.
</p>
</div>
</div>
</div>
</div>
</main>
<footer id="postamble" class="status">
<p align="center" style="font-size:0.7em;">
<br>
- - - - - - -  - - - - - - -  - - - - - - -  - - - - - - -
<br><br>
2023 - <b>Dilip<sup></sup></b>- Made with 󰣐  using <a href="https://orgmode.org/">Org-mode</a> &amp; <a href="https://www.gnu.org/software/emacs/">Emacs</a>
<br>
The <a href="https://github.com/idlip/idlip.github.io">code</a> for this site is licensed under the <a href="https://www.gnu.org/licenses/gpl-3.0.en.html">GPLv3</a>, and the content is licensed under <a href="https://creativecommons.org/licenses/by-sa/4.0/">CC-BY-SA 4.0</a>
</p>

<!-- with org convert -->

<!-- #+attr_html: :align center :style font-size:0.7em; -->
<!-- Made with 󰣐  using [[https://orgmode.org][Org-mode]] & [[https://www.gnu.org/software/emacs/][Emacs]] -->
<!-- The [[https://github.com/idlip/idlip.github.io][code]] for this site is licensed under the [[https://www.gnu.org/licenses/gpl-3.0.en.html][GPLv3]], and the content is licensed under [[https://creativecommons.org/licenses/by-sa/4.0/][CC-BY-SA 4.0]] -->
</footer>
</body>
</html>
